In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

## liste ile dataframe oluşturma

In [2]:
datam = [1,2,3,4,5,6,7,8]

In [3]:
pd.DataFrame(datam, columns = ["sayılar"])

# burda benden bir column name istiyor.

   sayılar
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8

## numpy array ile dataframe oluşturma

In [4]:
m = np.arange(1, 10).reshape((3,3))

In [5]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

# burda 3 tane column olduğu için 3 column ismi veriyorum

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [6]:
# bunu bir değişkene atayalım

df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])

In [7]:
df.head(3)

# ilk 3 satırı gösterir. default olarak bu değer 5

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [8]:
df.columns

# sütunların isimlerini getirtiyoruz

Index(['var1', 'var2', 'var3'], dtype='object')

In [10]:
df.columns = ["sütun1", "var2", "sütun3"]
df.head(3)

# sütun isimlerini değiştirmek istersek

   sütun1  var2  sütun3
0       1     2       3
1       4     5       6
2       7     8       9

In [11]:
df.shape 

# dataframe'in şeklini görüyoruz. 3'e 3'lük bir dataframe imiş.

(3, 3)

In [12]:
df.values

# dataframe'in içindeki bilgileri görüyoruz

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

## dictionary ile dataframe oluşturma

In [13]:
s1 = np.random.randint(10, size = 5)

# üst sınırı 10 olacak şekilde bana 5 tane sayı getir

s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [14]:
s3

array([1, 3, 7, 0, 1])

In [15]:
mydict = {"var1" : s1, "var2" : s2, "var3" : s3}
mydict

{'var1': array([0, 5, 9, 1, 7]),
 'var2': array([5, 8, 3, 1, 2]),
 'var3': array([1, 3, 7, 0, 1])}

In [19]:
df1 = pd.DataFrame(mydict)
df1

# mydict sözlüğünü değişken olarak kullanarak dataframe oluşturduk.
# sözlüğün keylerinin dataframe'in sütun isimleri, value'larının da dataframe value'ları olduğuna dikkat et!

   var1  var2  var3
0     0     5     1
1     5     8     3
2     9     3     7
3     1     1     0
4     7     2     1

## dışardan bir dosya açarak

In [21]:
df3 = pd.read_csv("ornek.csv") 

# csv : comma seperated values

# pandas, virgüllerle ayrılmış değerleri alıp tabloya çeviriyor.

In [22]:
df3.head()

    a   b     c
0  10  12   3.0
1  11  33  34.0
2  44  51   NaN
3  10  12   4.0
4  11  33  35.0

In [23]:
df3.shape

# df3'ün şekli 15'e 3 bir matris

(15, 3)

## indexing and slicing

In [24]:
df1[1:3]

# 1. ve 2. indeksteki SATIRLARI getiriyor

   var1  var2  var3
1     5     8     3
2     9     3     7

In [26]:
df1.index = ["a", "b", "c", "d", "e"]
df1

# indekslerinin isimlerini de değiştirebiliyoruz

   var1  var2  var3
a     0     5     1
b     5     8     3
c     9     3     7
d     1     1     0
e     7     2     1

In [27]:
# bir slicing yapalım

df1["a" : "d"]

# indeks adı "a" ile "d" arasındaki satırları getir.
# bu kullanımda belirtilen satırlar DAHİL getirir.

   var1  var2  var3
a     0     5     1
b     5     8     3
c     9     3     7
d     1     1     0

In [28]:
"A B C D E".split()

['A', 'B', 'C', 'D', 'E']

In [29]:
np.random.randn(5, 4)

# random olarak 0 ortalamalı 1 standart sapmalı 5'e 4 bir matris ürettik.

array([[-0.24500824, -0.16184316, -0.62463519,  0.15805224],
       [ 1.4449304 ,  1.39838174, -0.72008266,  0.28181695],
       [ 0.37081259, -2.45413815, -1.26849096,  0.77534537],
       [-0.84729111, -1.41918168,  0.3341735 , -0.5509617 ],
       [-1.30088835,  0.34823964, -0.43737524,  0.89940843]])

In [30]:
np.random.seed(101)

# seed kullanıdığımızda 101 rakamını giren herkeste aynı sayılar random olarak oluşacaktır.

df3 = pd.DataFrame(np.random.randn(5,4), index = "A B C D E".split(), columns = "W X Y Z".split())

In [31]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
type(df3["W"])

# df3["W"] nin bir seri olduğunu gördükk

pandas.core.series.Series

In [34]:
df3[["W"]]

# iki köşeli parantez bunu bir DataFrame yapar.

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [35]:
type(df3[["W"]])

# iki köşeli parantez bunu bir DataFrame yapar.

pandas.core.frame.DataFrame

In [36]:
df3[["W", "Z"]]

# birden fazla sütun getirelim

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [39]:
# yeni bir sütun oluşturalım ve bu "W" ile "Z" nin toplamına eşit olsun:

df3["yeni_sütun_W+Z"] = df3["W"] + df3["Z"]

df3

          W         X         Y         Z  yeni_sütun  yeni_sütun_W+Z
A  2.706850  0.628133  0.907969  0.503826    3.210676        3.210676
B  0.651118 -0.319318 -0.848077  0.605965    1.257083        1.257083
C -2.018168  0.740122  0.528813 -0.589001   -2.607169       -2.607169
D  0.188695 -0.758872 -0.933237  0.955057    1.143752        1.143752
E  0.190794  1.978757  2.605967  0.683509    0.874303        0.874303

##  sütun silme & dropping

In [ ]:
"""
deleting a column

del df['column_name']

df = df.drop('column_name', 1) # column label ile drop

columns = ['Col1', 'Col2', ...]
df.drop(columns, inplace=True, axis=1)

df.drop(columns=['B', 'C'])

to drop by column number instead of by column label, 
try this to delete, e.g. the 1st, 2nd and 4th columns:
df.drop(df.columns[[0, 1, 3]], axis=1)  # df.columns is zero-based pd.Index

df.drop(df.columns[[0,1,3]], axis=1, inplace=True) # Delete first, second and fourth columns:

df.drop(df.columns[[0]], axis=1, inplace=True) # Delete first column:

"""

In [44]:
df3.drop("yeni_sütun", inplace = True, axis = 1)
df3

          W         X         Y         Z  yeni_sütun_W+Z
A  2.706850  0.628133  0.907969  0.503826        3.210676
B  0.651118 -0.319318 -0.848077  0.605965        1.257083
C -2.018168  0.740122  0.528813 -0.589001       -2.607169
D  0.188695 -0.758872 -0.933237  0.955057        1.143752
E  0.190794  1.978757  2.605967  0.683509        0.874303

In [45]:
del df3['yeni_sütun_W+Z']
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df3["yepyeni"] = df3["X"] * df3["Z"]
df3

# önce yeni bir sütun oluşturalım

          W         X         Y         Z   yepyeni
A  2.706850  0.628133  0.907969  0.503826  0.316469
B  0.651118 -0.319318 -0.848077  0.605965 -0.193496
C -2.018168  0.740122  0.528813 -0.589001 -0.435932
D  0.188695 -0.758872 -0.933237  0.955057 -0.724766
E  0.190794  1.978757  2.605967  0.683509  1.352498

In [47]:
df3.drop(["yepyeni"], axis = 1, inplace = True)
df3

# sütun silerken axis'i 1 girmeyi unutmuyoruz.
# inplace = True yapınca yapılan işlem kalıcı olur.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
# şimdi de bir satır silelim

df3.drop(["C"], axis = 0)

# bu satırı silmek isteseydim inplace = True eklemem gerekirdi.
# veya bu işlemi yeniden df3'e atamam gerekirdi.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# .loc  vs  .iloc

In [50]:
m = np.random.randint(1, 30, size = (10, 3))
df4 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df4

   var1  var2  var3
0     8    11    21
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13
5     1    21    11
6    13    18    25
7    12    20    16
8     2    25     5
9    29    20    19

In [ ]:
df4.loc[1]

# bana 1. satırdaki column'ların değerlerini getiriyor

In [51]:
df4.loc[1:4]

# 1 - 4 arası (4 DAHİL) satırları getirir.
# loc ile daha çok satırın labelı ile çalışıyoruz. (ancak burada numara girdik)

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13

In [52]:
df4.iloc[1:4]

# 1-4 arası (4 hariç) indeksteki satırları getirir.
# iloc ile indeksi numerik olarak giriyoruz.

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8

In [53]:
"a b c d e f g h i j".split()

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [60]:
df4.index = "a b c d e f g h i j".split()
df4

# satırlara yukardaki index ismilerini atadık

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11
g    13    18    25
h    12    20    16
i     2    25     5
j    29    20    19

In [61]:
df4.loc["a" : "f"]

# a ve f dahil satırları getirdi

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11

In [62]:
df4.loc["a" : "f"]["var2"]

a    11
b     8
c    10
d    24
e    16
f    21
Name: var2, dtype: int32

In [63]:
df4.iloc[1:5]["var2"]

# iloc ile indeksi SAYISAL olarak belirtiyoruz.

# 1 ile 5. index arası satırlardan var2 sütunu bilgilerini getir

b     8
c    10
d    24
e    16
Name: var2, dtype: int32

In [64]:
df3

# df3'ü hatırlayalım.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df3.iloc["A"]

# iloc integer değerlerle çalıştığı için hata verdi.

TypeError: Cannot index by location index with a non-integer key

In [65]:
df3.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [67]:
df3.info()

# DataFrame bilgilerini gösterir.

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [71]:
# iloc ile Y sütununun hepsini yazdırmak istiyoruz

df3.iloc[:, [2]]

# : ile tüm satırları seçmiş oluyoruz. 2 ile 2.indeksteki sütunu yani Y'yi seçiyoruz

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [72]:
# Y'den sonraki sütunları getirsin istiyorsak:

df3.iloc[:, 2:]

# 2:  2. indeksteki sütun ve sonrasını getir.

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [77]:
df3["Y"]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [73]:
df3.Y

# bu şekilde noktadan sonra  direk sütun ismi olarak da pratik olarak yazabiliyoruz

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [78]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
df3[df3["W"] > 0]

# df3'ün W sütununun değeri 0 dan büyük olan satırları getir.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df3[df3["W"] > 0]["Y"]

# df3'ün "W" sütununun değeri 0 dan büyük olan "Y" sütununun değerlerini getir.

In [ ]:
df3[df3["W"] > 0]["Y", "Z"]

# df3'ün "W" sütununun değeri 0 dan büyük olan "Y" ve "Z" sütunlarının değerlerini getir.

In [81]:
df3[df3["W"] > 0]["Y"]["B"]

# df3'ün "W" sütununun değeri 0 dan büyük olan "Y" sütununun B satırındaki değeri getir.

-0.8480769834036315

## And filtering

In [82]:
df3[(df3["W"] > 0) & (df3["Y"] > 0.5)]

# "W'su 0 dan büyük ve "Y" si 0.5 ten büyük olan satırları getir

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

## Or filtering

In [83]:
df3[(df3["W"] > 0) | (df3["Y"] > 0.5)]

# "W'su 0 dan büyük veya "Y" si 0.5 ten büyük olan satırları getir

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Reset Index

In [84]:
df3.reset_index()

# halihazırda A dan E ye olarak belirlenmiş index label ları yerine (default olan) 0'dan başlayan değerleri getirir.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [85]:
df3.reset_index(drop = True)

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [86]:
df3

# inplace = True demediğim için orjinal df3'üm değişmedi.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [90]:
new_index = "CA NY WY OR CO".split()

new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [98]:
df3["States"] =  new_index
df3

# States isminde sütun oluşturup içeriğini new_index içeriği yaptık

               W         X         Y         Z States
States
CA      2.706850  0.628133  0.907969  0.503826     CA
NY      0.651118 -0.319318 -0.848077  0.605965     NY
WY     -2.018168  0.740122  0.528813 -0.589001     WY
OR      0.188695 -0.758872 -0.933237  0.955057     OR
CO      0.190794  1.978757  2.605967  0.683509     CO

In [99]:
outside = ["M1", "M1", "M1", "M2", "M2", "M2"]
inside = [1,2,4,1,2,3]

In [100]:
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1), ('M1', 2), ('M1', 4), ('M2', 1), ('M2', 2), ('M2', 3)]

In [101]:
hier_index = pd.MultiIndex.from_tuples(multi_index)
hier_index

# hiyerarşik bir indeks oluşturmak için pandasın yukardaki özelliğini kullandık

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 4),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3)],
           )

In [102]:
type(hier_index)

pandas.core.indexes.multi.MultiIndex

In [104]:
df5 = pd.DataFrame(np.random.randn(6,2), index = hier_index, columns = ["A", "B"])

df5

             A         B
M1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   4  2.154846 -0.610259
M2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [105]:
df5.loc["M1"]

# M1 kısmını parsel olarak alıp getirdi.

          A         B
1  1.025984 -0.156598
2 -0.031579  0.649826
4  2.154846 -0.610259

In [106]:
df5.loc["M1"].loc[[1]]

# indeksleyerek M2 kısmının 1 numaralı satırını getirdik.

          A         B
1  1.025984 -0.156598

In [110]:
df5.xs("M1")

# aslında loc'un yaptığı işlemi yapmış oldu.
# M1 i çekip getirdi.

          A         B
1  1.025984 -0.156598
2 -0.031579  0.649826
4  2.154846 -0.610259

In [114]:
df5

             A         B
M1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   4  2.154846 -0.610259
M2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [113]:
df5.xs(("M1", 1))

 # M1'in 1. satırını getirdik.

A    1.025984
B   -0.156598
Name: (M1, 1), dtype: float64

# seaborn kütüphanesi

In [115]:
df = sns.load_dataset("planets")

df.head()

 # önce bir head ine bakıp matrisin hangi sütunlardan oluştuğuna bakıyorumn

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [116]:
df.shape

# sonra kaç satır kaç sütundan olduğunu görelim

(1035, 6)

In [117]:
df.tail

<bound method NDFrame.tail of                method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]>

In [118]:
df.sample()

# Return a random sample of items from an axis of object.
# bir tane rastgele satır örneği alıp gördük

              method  number  orbital_period    mass  distance  year
303  Radial Velocity       3          14.025  0.0187     25.59  2011

In [119]:
df.describe()

# Generate descriptive statistics.
# Tanımlayıcı istatistikleri generate edip gördük.

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [120]:
df.info()

# Print a concise summary of a DataFrame.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [121]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [122]:
df.iloc[1:5, 2:4]

# satır numarası 1 ile 5. indeksi arasında, sütunu 2 ile 4. indeksi arasında olan kısmı getir.

   orbital_period   mass
1         874.774   2.21
2         763.000   2.60
3         326.030  19.40
4         516.220  10.50

In [123]:
# number sütununu düşelim.

df.drop("number", axis = 1)  # inplace eklersem sütunu kalıcı olarak  siler

               method  orbital_period   mass  distance  year
0     Radial Velocity      269.300000   7.10     77.40  2006
1     Radial Velocity      874.774000   2.21     56.95  2008
2     Radial Velocity      763.000000   2.60     19.84  2011
3     Radial Velocity      326.030000  19.40    110.62  2007
4     Radial Velocity      516.220000  10.50    119.47  2009
...               ...             ...    ...       ...   ...
1030          Transit        3.941507    NaN    172.00  2006
1031          Transit        2.615864    NaN    148.00  2007
1032          Transit        3.191524    NaN    174.00  2007
1033          Transit        4.125083    NaN    293.00  2008
1034          Transit        4.187757    NaN    260.00  2008

[1035 rows x 5 columns]

In [124]:
# mass değeri 3ten büyük olan ve distance değeri 180 den büyük olan satırları getir.

df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [125]:

df[(df["mass"] > 3) & (df["distance"] > 180)]

              method  number  orbital_period  mass  distance  year
161  Radial Velocity       2           428.5  15.2    214.00  2009
181  Radial Velocity       2          1022.0   3.4    354.00  2011
245  Radial Velocity       1           471.6  14.0    300.30  2005
396  Radial Velocity       1           647.3   4.0    221.24  2011
563  Radial Velocity       1          4885.0   3.1    189.39  2009
587  Radial Velocity       1           875.5   9.9    352.11  2012
610  Radial Velocity       1           672.1  11.1    289.02  2012
620  Radial Velocity       1           745.7   5.3    307.69  2011